app/Helpers/functions.php

select * from `users` where `id` = 1 limit 1
---
    function user()
    {
        $user = User::with('roles')->where('id', auth()->guard('web')->id())->first();