app/Providers/FortifyServiceProvider.php

    public function boot()
    {
        Fortify::createUsersUsing(CreateNewUser::class);
        Fortify::updateUserProfileInformationUsing(UpdateUserProfileInformation::class);
        Fortify::updateUserPasswordsUsing(UpdateUserPassword::class);
        Fortify::resetUserPasswordsUsing(ResetUserPassword::class);

        RateLimiter::for('login', function (Request $request) {
            $email = (string) $request->email;

            return Limit::perMinute(5)->by($email . $request->ip());
        });

        RateLimiter::for('two-factor', function (Request $request) {
            return Limit::perMinute(5)->by($request->session()->get('login.id'));
        });

        Fortify::loginView(function () {
            $login_title = 'User Login';
            return view('auth.pages.login', compact('login_title'));
        });
        Fortify::authenticateUsing(function (Request $request) {
            $user = User::where(['email' => $request->email, 'status' => 1])->first();

            if (
                $user &&
                Hash::check($request->password, $user->password)
            ) {
                if($user->last_login_at){
                    $user->update(['last_login_at'=> now()->format('Y-m-d H:i:s')]);
---
select * from `users` where (`email` = 'xyz@gmail.com' and `status` = 1) limit 1
update `users` set `last_login_at` = '2023-12-23 05:05:42', `users`.`updated_at` = '2023-12-23 05:05:42' where `id` = 1